Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: In addition to specifying requirements that conforming types must implement, you can extend a protocol to implement some of these requirements or to implement additional functionality that conforming types can take advantage of.
ja: 準拠する型が実装しなければならない要件を指定することに加えて、あなたはあるプロトコルを拡張してそれらの要件のいくつかを実装したり、更なる機能性を実装したりできます、それらは、準拠する型それぞれで利用可能です。

source: In addition to stored properties, classes, structures, and enumerations can define computed properties, which do not actually store a value.
ja: 格納プロパティに加えて、クラス、構造体、および列挙は計算プロパティを定義することができます、それは、実際に値を格納しません。

source: In addition to the characteristics it inherits, the Bicycle class defines a new stored property, hasBasket, with a default value of false (inferring a type of Bool for the property).
ja: それが継承する特徴に加えて、Bicycleクラスは新しい格納プロパティ、hasBasketを、falseの省略時の値を使って定義します（このプロパティに対してはBoolの型が推論されます）。

source: In addition to the operators described in Basic Operators, Swift provides several advanced operators that perform more complex value manipulation.
ja: 基本の演算子で記述される演算子に加えて、スウィフトはより複雑な値操作を実行するいくつかの先進の演算子を提供します。

source: In addition to the standard library operators, you use & immediately before the name of a variable that’s being passed as an in-out argument to a function call expression.
ja: 標準ライブラリ演算子に加えて、あなたは&を変数の名前の直前で使います、それはin-out引数として関数呼び出し式に渡されています。

source: In addition to the wrapped value, a property wrapper can expose additional functionality by defining a projected value—for example, a property wrapper that manages access to a database can expose a flushDatabaseConnection() method on its projected value.
ja: そのラップされた値に加えて、プロパティラッパーは予測値を定義することによっていっそうの機能性を露出できます — 例えば、データベースへのアクセスを管理するプロパティラッパーは、flushDatabaseConnection()メソッドをそれの見込値に関して露出できます。

source: In addition to these two simple properties, the HTMLElement class defines a lazy property called asHTML.
ja: これらの２つの単純なプロパティに加えて、HTMLElementクラスは、asHTMLと呼ばれる遅延プロパティを定義します。

source: In addition to user-defined named types, the Swift standard library defines many commonly used named types, including those that represent arrays, dictionaries, and optional values.
ja: ユーザー定義の名前付きの型に加えて、スウィフト標準ライブラリは、配列、辞書、そしてオプショナル値を表すものたちを含む、多くの一般に使われる名前付きの型を定義します。

source: In addition to verifying your expectations at runtime, assertions and preconditions also become a useful form of documentation within the code.
ja: あなたの期待を実行時で実証するのに加えて、表明と前提条件はまたコード内部での有用な文書化形式となります。

source: In addition, Swift provides a do statement to introduce scope, and catch and handle errors, and a defer statement for running cleanup actions just before the current scope exits.
ja: 加えて、スウィフトは、do文をスコープを導入し、それでエラーを捕えて処理するために、そしてdefer文を現在のスコープを脱出する直前にさまざまな片付け活動を実行するために提供します。

source: In addition, for classes that are defined in the same module, you can override any class member (method, property, initializer, or subscript) that’s visible in a certain access context.
ja: それに加えて、同じモジュールにおいて定義されるクラスに対して、あなたは特定のアクセス前後関係において可視であるあらゆるクラスメンバー（メソッド、プロパティ、イニシャライザ、または添え字）をオーバーライドすることができます。

source: In addition, subscripts can’t have in-out parameters.
ja: 加えて、添え字はin-outパラメータを持つことができません。

source: In addition, the catch clause must handle only errors thrown by one of the rethrowing function’s throwing parameters.
ja: 加えて、そのcatch節はスロー関数の持つスローパラメータの１つによってスローされるエラーのみを取り扱わなければなりません。

source: In addition, you can define property observers to monitor changes in a property’s value, which you can respond to with custom actions.
ja: それに加えて、あなたはプロパティオブザーバーを定義して、あるプロパティの値の変化を監視することができて、あなたはあつらえの動作でそれに応答することができます。

source: In all other cases, dynamicallyCall(withArguments:) is called.
ja: 全ての他の場合には、dynamicallyCall(withArguments:)が呼び出されます。

source: In all other cases, the dice roll is a valid move.
ja: 他の全ての場合には、さいころの目は有効な移動となります。

source: In all other cases, you must use an initializer expression.
ja: すべての他の場合では、あなたはイニシャライザ式を使う必要があります。

source: In all three functions, the types of a and b must be the same.
ja: ３つの関数すべてにおいて、aとbの型は同じでなければなりません。

source: In an if statement, the conditional must be a Boolean expression—this means that code such as if score { ... } is an error, not an implicit comparison to zero.
ja: if文において、その条件を表すのはブール式でなければなりません ― これはif score { ... }のようなコードがエラーになることを意味します、暗黙的なゼロとの比較はしないためです。

source: In an explicit member expression, if there isn’t a corresponding declaration for the named member, the expression is understood as a call to the type’s subscript(dynamicMemberLookup:) subscript, passing information about the member as the argument.
ja: 明示的なメンバ式において、名前付きメンバに対して対応する宣言がないならば、式は型の持つsubscript(dynamicMemberLookup:)添え字に対する呼び出しとして理解されます、メンバについての情報を引数として渡します。

source: In an initializer, constant properties can now only assign a value once.
ja: ある初期化において、定数プロパティは今ではただ一度しか値を割り当てることができません。

source: In an initializer, subscript, or instance method, self refers to the current instance of the type in which it occurs.
ja: イニシャライザ、添え字、またはインスタンスメソッドでは、selfはそれが現れているところの型の現在のインスタンスに言及します。

source: In both cases, a write access to the tuple element requires a write access to the entire tuple.
ja: 両方の場合において、タプル要素に対する書き込みアクセスは、タプル全体に対する書き込みアクセスを要求とします。

source: In both cases, it is written as (s1: String, s2: String) -> Bool.
ja: 両方の場合において、それは(s1: String, s2: String) -> Boolのように書かれます。

source: In both cases, program control is then transferred to the condition of the enclosing loop statement.
ja: 両方の場合において、プログラム制御はそれから囲んでいるループ文の条件へ移されます。

source: In both cases, program control is then transferred to the first line of code following the enclosing loop or switch statement, if any.
ja: 両方の場合において、プログラム制御はそれから、もしあれば、それを囲んでいるループまたはswitch文に続くコードの最初の行へ移されます。

source: In both cases, the constant someArray is declared as an array of strings.
ja: 両方の場合で、定数のsomeArrayは、文字列の配列として宣言されます。

source: In both cases, the constant someDictionary is declared as a dictionary with strings as keys and integers as values.
ja: 両方の場合で、定数someDictionaryは、キーとして文字列そして値として整数を持つ辞書として宣言されます。

source: In both cases, the letter é is represented as a single Swift Character value that represents an extended grapheme cluster.
ja: 両方の場合で、文字éは、単一のスウィフトのCharacter値として表わされます、それはひとつの拡張書記素クラスタを表わします。

source: In both cases, the value of the whole expression is an optional value.
ja: 両方の場合で、その全体の式の値は、オプショナルの値となります。

source: In both cases, the variable optionalInteger is declared to have the type of an optional integer.
ja: 両方の場合には、変数optionalIntegerは、オプショナル整数の型を持つと宣言されます。

source: In both cases, you add conformance to the standard library’s Equatable protocol.
ja: 両方の場合において、あなたは標準ライブラリのもつEquatableプロトコルへの準拠を加えます。

source: In both cases, you must mark the initializer implementation with the required modifier:
ja: 両方の場合で、あなたはそのイニシャライザ実装をrequired修飾子で印しなければなりません：

source: In both of the examples above, the type information is passed up from the leaves of the expression tree to its root.
ja: 上の例の両方とも、型情報は、式ツリーの葉っぱから、その根までさかのぼって渡されます。

source: In certain constructs, operators with a leading < or > may be split into two or more tokens.
ja: 特定の構造物において、先導する<または>をもつ演算子は、２つ以上のトークンに分割されるでしょう。

source: In code below, optionalString doesn’t have an explicit type so it’s an ordinary optional.
ja: 下のコードにおいて、optionalStringは明示的な型を持ちません、それでそれは普通のオプショナルです。

source: In contrast to optionals, which can use the presence or absence of a value to communicate success or failure of a function, error handling allows you to determine the underlying cause of failure, and, if necessary, propagate the error to another part of your program.
ja: オプショナルと対比して（それは値の有無を使って、ある関数の成否を伝えることができます）、エラー処理はあなたに根本的な失敗の原因を突き止めること、そして、必要ならば、そのエラーをあなたのプログラムの別の部分に伝えることを可能にします。

source: In contrast to the willSet observer, the old value of the variable or property is passed to the didSet observer in case you still need access to it.
ja: willSetオブザーバーと対照的に、変数またはプロパティの古い値が、あなたがまだそれへのアクセスを必要とする場合に備えてdidSetオブザーバーに渡されます。

source: In contrast with switch statements in C and Objective-C, switch statements in Swift do not fall through the bottom of each case and into the next one by default.
ja: CおよびObjective-Cのswitch文とは対照的に、スウィフトのswitch文は、なにもしなくても、各ケース節の底を突き抜けて次のものに行ったりしません。

source: In contrast with generic types, you don’t specify a generic argument clause when you use a generic function or initializer.
ja: 総称体型と対照的に、あなたが総称体の関数やイニシャライザを使うとき、あなたは総称体引数節を指定しません。

source: In contrast, newString is a string—when it’s created from the substring, it has its own storage.
ja: 対照的に、newStringは文字列です — それが下位文字列から作成されるとき、それはそれ独自のストレージを持ちます。

source: In contrast, both lines of goodStart end with a line break, so when it’s combined with end the result has three lines, as expected.
ja: 対照的に、goodStartの行は両方とも改行で終わります、それでそれがendと結合される場合その結果は３行になります、予想通りに。

source: In contrast, opaque types preserve the identity of the underlying type.
ja: 対照的に、不透明型は基礎をなす型の同一性を保全します。

source: In contrast, passing playerOneScore as the value for both parameters produces a conflict because it tries to perform two write accesses to the same location in memory at the same time.
ja: 対照的に、playerOneScoreをそれらパラメータ両方の値として渡すことは衝突を生み出します、なぜならそれは２つの書き込みアクセスをメモリ中の同じ位置に同じ時間に実行しようと試みるからです。

source: In contrast, the closure passed to someFunctionWithNonescapingClosure(_:) is a nonescaping closure, which means it can refer to self implicitly.
ja: 対照的に、someFunctionWithNonescapingClosure(_:)に渡されるクロージャは非脱出クロージャです、それは、それがselfを暗黙的に参照できるのを意味します。

source: In contrast, the constants and variables created with a guard statement are available in the lines of code that follow the guard statement, as described in Early Exit.
ja: 対照的に、guard文で作成された定数と変数は、そのguard文以降のコード行において利用可能です、早期退出において議論されるように。

source: In contrast, the two function calls marked “OK” don’t cause a compiler error.
ja: 対照的に、「OK」と記される２つの関数呼び出しは、コンパイラエラーを引き起こしません。

source: In contrast, there is only one variable named b—the b in the outer scope—so changes from inside or outside the closure are visible in both places.
ja: 対照的に、bと名前を付けられるただ１つだけの変数があります ― 外側のスコープの中のb ― それでクロージャ内部および外部からの変更は、両方の場所で見ることができます。

source: In contrast, two tuples of type (String, Bool) can’t be compared with the < operator because the < operator can’t be applied to Bool values.
ja: 対照的に、型(String, Bool)の２つのタプルは<演算子で比較できません、なぜなら<演算子はBool値に適用できるからです。

source: In contrast, use an unowned reference when the other instance has the same lifetime or a longer lifetime.
ja: 対照的に、非所有参照を他のインスタンスが同じ生涯またはより長い生涯を持つ場合に使ってください。

source: In contrast, value types are easier to reason about because all of the code that interacts with the same value is close together in your source files.
ja: 対照的に、値型について思考するのはより簡単です、なぜなら同じ値に相互作用するコードの全ては、あなたのソースファイルの中で近接しているからです。

source: In contrast, when creating a selector for a property’s setter, the property name must be a reference to a variable property only.
ja: 対照的に、プロパティのセッターのためのセレクタを作成するとき、property nameは必ず変数プロパティへの参照でなければなりません。

source: In contrast, without parentheses, (Int, Int) -> Void is the type of a function that takes two Int parameters and doesn’t return any value.
ja: 対して、丸括弧なしで、(Int, Int) -> Voidは、２つのIntパラメータを取り、何ら値を返さない関数の型です。

source: In dot syntax, you write the property name immediately after the instance name, separated by a period (.), without any spaces:
ja: ドット構文において、あなたはプロパティ名をインスタンス名の直後に、終止符（.）で区切り、どんな空白もなしで、書きます：

source: In each case, a new copy of the existing String value is created, and the new copy is passed or assigned, not the original version.
ja: それぞれの場合において、既存のString値の新しいコピーがつくられます、そしてその新しいコピーが渡されるか代入されます、元々のものではなく。

source: In each case, the type parameter is replaced with an actual type whenever the function is called.
ja: それぞれの場合において、型パラメータは、その関数が呼ばれるときはいつでも実際の型と取り替えられます。

source: In each form, the name of the operator can contain only the operator characters defined in Operators.
ja: 各形式において、演算子の名前は演算子で定義される演算子文字だけを含むことができます。

source: In each form, the opening and closing braces are required.
ja: 各形式で、開始と終了の波括弧は必須です。

source: In either case, if you delegate to another initializer that causes initialization to fail, the entire initialization process fails immediately, and no further initialization code is executed.
ja: どちらの場合においても、あなたが初期化失敗の原因となる別のイニシャライザに委任するならば、全体の初期化プロセスは直ちに失敗します、そしてそれ以上初期化コードが実行されることはありません。

source: In either case, the value of the postfix expression is still of an optional type.
ja: いずれにせよ、接尾辞式の値は、依然としてオプショナル型です。

source: In either case, these accesses cause the closure to “capture” self, creating a strong reference cycle.
ja: いずれにせよ、これらのアクセスは、クロージャが強い参照循環をつくってselfを「捕獲する」ことを引き起こします。

source: In essence, it’s the same problem as above—two strong references are keeping each other alive.
ja: 本質において、それは上記と同じ問題です ― ２つの強い参照が、お互いを生かし続けています。

source: In fact, someFunction() won’t compile as written below:
ja: 実際、someFunction()は以下のように書かれるときコンパイルしないでしょう：

source: In fact, all of the basic types in Swift—integers, floating-point numbers, Booleans, strings, arrays and dictionaries—are value types, and are implemented as structures behind the scenes.
ja: 実際、スウィフトにおける基本の型の全て ― 整数、浮動小数点数、ブール、文字列、配列および辞書 ― は、値型であり、そして舞台裏では構造体として実装されます。

source: In fact, if the first value is false, the second value won’t even be evaluated, because it can’t possibly make the overall expression equate to true.
ja: 実際には、最初の値がfalseならば、２番目の値は評価されさえしません、なぜならそれがどうやっても式全体をtrueと等しくすることが出来ないためです。

source: In fact, in cases where there isn’t a meaningful raw value, you don’t have to provide one.
ja: 実際、意味がある生の値がない状況の場合には、あなたはそれを提供する必要はありません。

source: In fact, the point (0, 0) could match all four of the cases in this example.
ja: 実際、点(0, 0)は、この例ではケース節の４つ全てに適合することができました。

source: In fact, you’ve been using generics throughout the Language Guide, even if you didn’t realize it.
ja: 実際、たとえあなたがそれを実感しなかったとしても、あなたはこの言語ガイドを通して総称体を使用していました。

source: In its general form, the availability condition takes a list of platform names and versions.
ja: それの一般的な形式において、有効性条件はプラットホーム名とバージョンを取ります。

source: In its initializer, the Hoverboard class sets only its color property.
ja: そのイニシャライザにおいて、Hoverboardクラスはそれのcolorプロパティのみを設定します。

source: In its simplest form, a switch statement compares a value against one or more values of the same type.
ja: その最も単純な形式では、switch文は、ある値を、同じ型の１つ以上の値に対して比較します。

source: In its simplest form, a stored property is a constant or variable that is stored as part of an instance of a particular class or structure.
ja: その最も単純な形式で、格納プロパティは、特定のクラスまたは構造体のあるひとつのインスタンスの一部として格納される定数または変数です。

source: In its simplest form, an initializer is like an instance method with no parameters, written using the init keyword:
ja: その最も単純な形式では、イニシャライザはパラメータのないインスタンスメソッドのようです、そしてinitキーワードを使用して書かれます。

source: In its simplest form, the if statement has a single if condition.
ja: その最も単純な形式において、if文はただ１つだけのif条件を持ちます。

source: In library evolution mode, code that interacts with members of nonfrozen structures and enumerations is compiled in a way that allows it to continue working without recompiling even if a future version of the library adds, removes, or reorders some of that type’s members.
ja: ライブラリ進化モードでは、非凍結の構造体および列挙のメンバーと相互作用するコードは、ある方法でコンパイルされます、それは、再コンパイルすることなしにそれに仕事を継続させます、たとえ将来のバージョンのライブラリが追加する、削除する、またはその型のもつメンバーのいくつかを再配置するとしてもです。

source: In many simple cases, you can ask Swift to provide synthesized implementations of the equivalence operators for you.
ja: 多くの単純な場合では、あなたはスウィフトに頼むことで、等価演算子の合成された実装をあなたに提供できます。

source: In most cases, wrappedValue is a computed value, but it can be a stored value instead.
ja: ほとんどの場合には、wrappedValueは計算される値です、しかしそれは代わりに格納される値であることもできます。

source: In most cases, this means that memory management “just works” in Swift, and you do not need to think about memory management yourself.
ja: ほとんどの場合、これは、スウィフトにおいてメモリ管理が「正確に機能する」こと、そしてあなたはあなた自身でメモリ管理について考える必要がないことを意味します。

source: In most cases, tokens are generated from the characters of a Swift source file by considering the longest possible substring from the input text, within the constraints of the grammar that are specified below.
ja: ほとんどの場合、トークンは、スウィフトのソースファイルの文字から、下で指定される文法の制約の範囲内で、その入力テキストからの最も長く取ることのできる下位文字列を考慮することによって生成されます。

source: In most cases, type parameters have descriptive names, such as Key and Value in Dictionary<Key, Value> and Element in Array<Element>, which tells the reader about the relationship between the type parameter and the generic type or function it’s used in.
ja: ほとんどの場合には、型パラメータは描写的な名前を持ちます、たとえばDictionary<Key, Value>におけるKeyとValueおよびArray<Element>におけるElementなど、それは読み手に型パラメータとそれがその中で使われる総称体型や関数との関係について語ります。

source: In most cases, you don’t need to pick a specific size of integer to use in your code.
ja: ほとんどの場合、あなたはあなたのコードにおいて使用するのに整数の特定のサイズを選択する必要はありません。

source: In order for this rule to be satisfied, a designated initializer must make sure that all of its own properties are initialized before it hands off up the chain.
ja: この規則が満たされるために、指定イニシャライザは、それがその連鎖を上って手渡す前に、それ自身のプロパティの全てが初期化されることを確認しなければなりません。

source: In order to work with them as their native type, you need to check their type, or downcast them to a different type, as described below.
ja: それらをそれらの生来の型として取り扱うために、下で述べるように、あなたはそれらの型を調べること、またはそれらを異なる型へダウンキャストすることが必要です。

source: In other words, the following two declarations are equivalent:
ja: 言い換えると、以下の２つの宣言は、等しいです：

source: In particular, a protocol can declare that conforming types must implement certain properties, methods, initializers, and subscripts.
ja: 特に、プロトコルは、準拠している型が特定のプロパティ、メソッド、イニシャライザ、そして添え字を実装しなければならないと宣言することができます。

source: In particular, the raw-value type must conform to the Equatable protocol and one of the following protocols: ExpressibleByIntegerLiteral for integer literals, ExpressibleByFloatLiteral for floating-point literals, ExpressibleByStringLiteral for string literals that contain any number of characters, and ExpressibleByUnicodeScalarLiteral or ExpressibleByExtendedGraphemeClusterLiteral for string literals that contain only a single character.
ja: 特に、生の値型は、Equatableプロトコルおよび次のプロトコルの内の１つに準拠しなければなりません：整数リテラルのためのExpressibleByIntegerLiteral、浮動小数点リテラルのためのExpressibleByFloatLiteral、随意の数の文字を含む文字列リテラルのためのExpressibleByStringLiteral、そしてただ１つの文字だけを含む文字列リテラルのためのExpressibleByUnicodeScalarLiteralまたはExpressibleByExtendedGraphemeClusterLiteral。

source: In particular, the order you insert items into a Dictionary doesn’t define the order they are iterated.
ja: 特に、あなたがDictionaryへと項目を挿入する順序はそれらが反復される順序を定義しません。

source: In practice, most access to the properties of a structure can overlap safely.
ja: 実際には、構造体のプロパティに対するほとんどのアクセスは安全にオーバーラップできます。

source: In practice, this means most of the custom data types you define will be structures and enumerations.
ja: 実際問題としては、これは、あなたが定義するほとんどのあつらえのデータ型は構造体や列挙になることを意味します。

source: In practice, this means that you do not need to write initializer overrides in many common scenarios, and can inherit your superclass initializers with minimal effort whenever it is safe to do so.
ja: 実際問題として、これは、あなたが多くの通常の状況ではイニシャライザのオーバーライドを書く必要がなく、そしてそれが安全にそうできる時はいつでも最小の努力であなたのスーパークラスのイニシャライザを継承することができることを意味します。

source: In practice, you don’t need to write self in your code very often.
ja: 実際問題として、あなたは頻繁にあなたのコードにselfを書く必要がありません。

source: In production builds, the condition inside an assertion isn’t evaluated.
ja: プロダクションビルドでは、表明内の条件は評価されません。

source: In situations where either type would be appropriate, Double is preferred.
ja: どちらの型でも適切である状況では、Doubleが望ましいです。

source: In some cases, this requirement is satisfied by inheriting one or more designated initializers from a superclass, as described in Automatic Initializer Inheritance below.
ja: 若干の場合には、この必要条件は、下記の自動的なイニシャライザ継承で記述されるように、あるスーパークラスから１つ以上の指定イニシャライザを継承することによって満たされます。

source: In some generic contexts, types that get behavior from conditional conformance to a protocol don’t always use the specialized implementations of that protocol’s requirements.
ja: いくつかの総称体文脈では、あるプロトコルに対する条件準拠由来の挙動を持つ型は、そのプロトコルの要件の特殊化された実装を必ず使うとは限りません。

source: In some situations, you might not want to use closed ranges, which include both endpoints.
ja: 同じ状況において、あなたは完結範囲を使いたいと思うかもしれません、それは両方の終端を含みます。

source: In systems that use garbage collection, weak pointers are sometimes used to implement a simple caching mechanism because objects with no strong references are deallocated only when memory pressure triggers garbage collection.
ja: ガベージコレクションを使うシステムにおいて、時おり弱いポインタが簡単なキャッシュの仕組みを実装するために使われます、なぜなら強い参照を持たないオブジェクトは、メモリの逼迫がガベージコレクションを引き起こす時のみに割り当て解除されるためです。

source: In that context, Self refers to the eventual type that conforms to the protocol.
ja: その文脈で、Selfはそのプロトコルに準拠する結果として生じる型に言及します。

source: In the Apartment example above, it’s appropriate for an apartment to be able to have no tenant at some point in its lifetime, and so a weak reference is an appropriate way to break the reference cycle in this case.
ja: 上のApartment例において、あるアパートがその生涯のどこかの時点で賃借人がいないことがあるというのは妥当です、なのでこの場合は弱い参照が参照循環を壊す適切な方法です。

source: In the CompassPoint example above, north, south, east and west don’t implicitly equal 0, 1, 2 and 3.
ja: 上のCompassPoint例で、north、south、eastそしてwestは、暗黙のうちに0、1、2そして3に等しくはありません。

source: In the SmallNumber example above, if you try to set the property to a number that’s too large, the property wrapper adjusts the number before storing it.
ja: 上のSmallNumber例において、あなたがプロパティをある大きすぎる数へと設定しようとするならば、プロパティラッパーはその数を調節します、それを格納する前に。

source: In the nourish(with:) function, if vend(itemNamed:) throws an error that’s one of the cases of the VendingMachineError enumeration, nourish(with:) handles the error by printing a message.
ja: nourish(with:)関数において、vend(itemNamed:)がVendingMachineError列挙のケース節の１つであるエラーをスローするならば、nourish(with:)はそのエラーをメッセージを出力することによって取り扱います。

source: In the restoreHealth() method above, a write access to self starts at the beginning of the method and lasts until the method returns.
ja: 上のrestoreHealth()メソッドにおいて、selfへの書き込みアクセスはメソッドの始まりで開始してメソッドが返るまでの間続きます。

source: In the swapTwoValues(_:_:) example above, the placeholder type T is an example of a type parameter.
ja: 上のswapTwoValues(_:_:)例で、プレースホルダ型Tは型パラメータの一例です。

source: In the repeat-while loop above, square += board[square] is always executed immediately after the loop’s while condition confirms that square is still on the board.
ja: 上のrepeat-whileループにおいて、square += board[square]は常に、このループのwhile条件がsquareはまだ盤上かを確認した直後に実行されます。

source: In the welcomeMessage example above, no initial value is provided, and so the type of the welcomeMessage variable is specified with a type annotation rather than being inferred from an initial value.
ja: 上のwelcomeMessageの例では、初期値が提供されません、それでwelcomeMessage変数の型は、最初の値から推論されるのではなく、型注釈で指定されます。

source: In the above example, approximateCount is evaluated in a switch statement.
ja: 上の例で、approximateCountはswitch文において評価されます。

source: In the above example, the buyFavoriteSnack(person:vendingMachine:) function is called in a try expression, because it can throw an error.
ja: 上の例において、buyFavoriteSnack(person:vendingMachine:)関数はtry式の中で呼び出されます、それがエラーをスローできるからです。

source: In the above example, the raw value of ExampleEnum.a is 0 and the value of ExampleEnum.b is 1.
ja: 上記の例で、ExampleEnum.aの値は0です、そしてExampleEnum.bの値は1です。

source: In the above example, the raw value of GamePlayMode.cooperative is "cooperative", the raw value of GamePlayMode.individual is "individual", and the raw value of GamePlayMode.competitive is "competitive".
ja: 上の例において、GamePlayMode.cooperativeの生の値は"cooperative"です、GamePlayMode.individualの生の値は"individual"です、そしてGamePlayMode.competitiveの生の値は"competitive"です。

source: In the body of a method
ja: メソッドの本文において

source: In the body of the function, the copy is modified.
ja: 関数の本体において、そのコピーが修正されます。

source: In the case of the sorted(by:) method, the purpose of the closure is clear from the fact that sorting is taking place, and it is safe for a reader to assume that the closure is likely to be working with String values, because it is assisting with the sorting of an array of strings.
ja: sorted(by:)メソッドの場合、クロージャの目的はソートが行われているという事実から明快です、そして、読者がクロージャはString値を扱っているようだと仮定しても差し支えありません、なぜならそれがいくつかの文字列からなる配列のソートを手伝っているからです。
